<template>
 <v-container fluid>
   <v-layout row wrap>
     <v-flex xs12 sm6 lg3 class="text-xs-center" v-for="(item, i) in terms" :key="i">
       <h5>{{ item.title }}</h5>
       <v-btn flat @click.stop="showTerms(item)">Подробнее</v-btn>
     </v-flex>
   </v-layout>
   <v-container>
     <v-dialog v-model="showDialog" width="500">
       <v-card>
        <v-card-text>{{ currentTerm.desc }}</v-card-text>
        <v-card-actions>
          <v-btn flat class="green--text" @click.stop="showDialog = false">Ок</v-btn>
        </v-card-actions>
       </v-card>
     </v-dialog>
   </v-container>
 </v-container>
</template>

<script>
  export default {
    data() {
      return {
        terms: [
          { title: 'Доставка', desc: `Доставка Вашего заказа по Украине осуществляется ЗА НАШ СЧЕТ курьерскими службами Новая почта и Укрпочта. Время доставка по территории Украины занимает от 1 до 3х рабочих дней. Точную дату получения товара вам сообщит менеджер при оформлении покупки.`},
          { title: 'Оплата', desc: `Оплатить товар можно следующими способами:• Безналичный расчет - перевод средств на расчетный счет интернет-магазина InDresser. После оформления заказа менеджер вышлет на вашу электронную почту счет-фактуру с платежными реквизитами. В этом случае, Ваш заказ отправляется сразу после зачисления денег на наш счет.• Перевод на карту "Приват Банка" - после оформления Вашего заказа менеджер сообщит вам реквизиты карты, на которую нужно перевести средства. В этом случае, Ваш заказ отправляется сразу после поступления денег на наш счет.• Наложенным платежом - оплата производится при получении товара в отделении курьерской службы доставки. За услугу наложенного платежа будет необходимо оплатить 2% от суммы стоимости покупки, а также внести предоплату в размере 100 грн на счет указанный менеджером, эта сумма будет вычтена из стоимости Вашего заказа. В случае отказа покупателя от заказа после отправки сумма 100 грн не возвращается.`},
          { title: 'Возврат', desc: 'В соответствии с п. 1.8 «Правил продажи товаров на заказ и вне офисных или торговых помещений» (Приказ Минэкономики Украины от 19.04.2007 г. № 103), возврат полученного товара допускается в течение 14 календарных дней после его доставки (получение в службе доставки).Если приобретенный в нашем интернет-магазине товар по каким-либо причинам вам не подошел и вы желаете обменять его на другой или же осуществить возврат, то сделать это можно при соблюдении следующих условий:• обмен или возврат товара осуществляется в течение двух недель (14 дней);• товар должен сохранить бирки, ярлыки, не иметь следов ношения, использования и т.д.;Покупатель самостоятельно оплачивает доставку возвращаемого товара, стоимость которой устанавливает курьерская служба.Если товар имеет заводской брак, то обратная доставка осуществляется за счет интернет-магазина InDresser.Срок возврата денежных средств установлен в соответствии с «Правилами продажи товаров на заказ и вне офисных или торговых помещений» (Приказ Минэкономики Украины от 19.04.2007 г. № 103) и составляет до 30 календарных дней, считая от даты получения «Продавцом» заполненного «Покупателем» оригинала заявления на возврат товара, которое направляется вместе с товаром.'},
          { title: 'Оформление ЗАКАЗА', desc: 'Если вы оформите заказ до 17-00 мы отправим в его в тот же день. В случае если заказ был оформлен после 17:00, в нерабочее время или в выходной день - заказ будет обработан на следующий рабочий день до 12-00.'},
        ],
        showDialog: false,
        currentTerm: {
          title: '',
          desc: ''
        }
      }
    },
    methods: {
      showTerms (item) {
        this.currentTerm.title = item.title;
        this.currentTerm.desc = item.desc;
        this.showDialog = true;
      }
    }
  }
</script>

<style scoped>

</style>